/* different widget same name replace string */
"A different widget with the same name is already installed on your computer. Would you like to replace it with this %@ widget?" = "Toinen widgetti, jolla on sama nimi, on jo asennettu tietokoneeseen. Haluatko korvata sen widgetillä %@?";

/* same name replace string */
"A file with the same name is already installed on your computer. Would you like to replace it with this %@ widget?" = "Toinen tiedosto, jolla on sama nimi, on jo asennettu tietokoneeseen. Haluatko korvata sen widgetillä ”%@”?";

/* warning for already installed in /Library, but newer */
"A newer version of this widget is already installed for all users of this computer. Install it in this user account only if you prefer to use this copy instead." = "Uudempi versio tästä widgetistä on jo asennettu kaikille tämän tietokoneen käyttäjille. Asenna se tälle tunnukselle vain, jos haluat mieluummin käyttää tätä kopiota.";

/* newer version replace string */
"A newer version of the %@ widget is already installed. Would you like to replace it?" = "Uudempi versio widgetistä %@ on jo asennettu. Haluatko korvata sen?";

/* older version replace string */
"An older version of the %@ widget is already installed. Would you like to replace it?" = "Vanhempi versio widgetistä %@ on jo asennettu. Haluatko korvata sen?";

/* warning for already installed in /Library, but older */
"An older version of this widget is already installed for all users of this computer. Install it in this user account only if you prefer to use this copy instead." = "Vanhempi versio tästä widgetistä on jo asennettu kaikille tämän tietokoneen käyttäjille. Asenna se tälle tunnukselle vain, jos haluat mieluummin käyttää tätä kopiota.";

/* install and open string */
"Do you want to install the %@ widget and open it in Dashboard?" = "Haluatko asentaa widgetin %@ ja avata sen Dashboardissa?";

/* end preview string */
"End Test" = "Lopeta kokeilu";

/* title for OK button */
"Install" = "Asenna";

/* installation failed title */
"The %@ widget can't be installed." = "Widgettiä %@ ei voida asentaa.";

/* ok button */
"OK" = "OK";

/* replace button, instead of install */
"Replace" = "Korvaa";

/* title for OK button when developer run is on */
"Run" = "Suorita";

/* preview button string */
"Test Drive" = "Kokeile";

/* invalid widget */
"You can't install the file %@ because it is not a valid widget." = "Tiedostoa ”%@” ei voida asentaa, koska se ei ole kelvollinen widgetti.";

/* already installed replace string */
"The %@ widget is already installed. Would you like to replace it?" = "Widgetti %@ on jo asennettu. Haluatko korvata sen?";

/* install quit and replace string */
"The widget you are installing is already installed on your computer, and one or more copies of it are open. Reinstalling it will close all copies of the widget." = "Asennettava widgetti on jo asennettu tietokoneelle ja yksi tai useampi kopio siitä on avoinna. Uudelleenasentaminen sulkee kaikki widgetin kopiot.";

/* install and quit string */
"The widget you are installing is already open. Installing this widget will close all copies of the widget." = "Widgetti, jota olet asentamassa, on jo avoinna. Widgetin asentaminen sulkee kaikki widgetin kopiot.";

/* widget deletion string */
"The widget you are replacing will be deleted immediately." = "Korvattava widgetti poistetaan välittömästi.";

/* warning for already installed in /Library */
"This widget is already installed for all users of this computer. Install it in this user account only if you prefer to use this copy instead." = "Tämä widgetti on jo asennettu kaikille tämän tietokoneen käyttäjille. Asenna se tälle tunnukselle vain, jos haluat mieluummin käyttää tätä kopiota.";

/* already installed with different name replace string */
"This widget is already installed on your computer, but it's named %@. Would you like to replace the widget %@ with the widget %@?" = "Tämä widgetti on jo asennettu tietokoneelle, mutta sen nimi on ”%@”. Haluatko korvata widgetin ”%@” widgetillä ”%@”?";

